app/controllers/apartments_controller.rb

  def index
    @apartments = Apartment.all
    @pindrop = Gmaps4rails.build_markers(@apartments) do |apartment, marker|
      marker.lat apartment.latitude
      marker.lng apartment.longitude
      marker.infowindow apartment.address
    end
    @user = User.all
---
SELECT "apartments".* FROM "apartments"
SELECT "users".* FROM "users"

  def show
    @apartments = Apartment.all
---
SELECT "apartments".* FROM "apartments"

  def create
    @apartment = Apartment.new(apartment_params)

    respond_to do |format|
      if @apartment.save
---
INSERT INTO "apartments" ("address", "name", "contact", "description", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id", "latitude", "longitude", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

  def update
    respond_to do |format|
      if @apartment.update(apartment_params)
---
UPDATE "apartments" SET "latitude" = $1, "longitude" = $2, "updated_at" = $3 WHERE "apartments"."id" = $4  [["latitude", 32.7475645], ["longitude", -117.1289597], ["updated_at", "2016-06-28 17:42:00.657188"], ["id", 1]]

  def destroy
    @apartment.destroy
---
DELETE FROM "apartments" WHERE "apartments"."id" = $1  [["id", 3]]

    def set_apartment
      @apartment = Apartment.find(params[:id])
---
SELECT  "apartments".* FROM "apartments" WHERE "apartments"."id" = $1 LIMIT 1  [["id", nil]]